boss_info = {

    # 聖守護者の闘戦記
    "g-purple": {
        "name": "冥骸魔レギルラッゾ＆獣魔ローガスト",
        "jobs": ["僧侶", "天地雷鳴士", "占い師"]
    },
    "g-red": {
        "name": "紅殻魔スコルパイド",
        "jobs": ["賢者", "どうぐ使い", "まもの使い"],
    },
    "g-green": {
        "name": "翠将鬼ジェルザーク",
        "jobs": ["僧侶", "魔法使い", "魔法戦士"],
    },
    "g-yellow": {
        "name": "剛獣鬼ガルドドン",
        "jobs": ["デスマスター", "賢者", "魔法使い", "魔法戦士"],
    },
    "g-blue": {
        "name": "邪蒼鎧デルメゼ",
        "jobs": ["僧侶", "どうぐ使い", "レンジャー", "武闘家", "まもの使い"],
    },
    "g-black": {
        "name": "羅刹王バラシュナ",
        "jobs": ["僧侶", "どうぐ使い", "魔法使い", "賢者"]
    },

    # 常闇の聖戦
    "regnard": {
        "name": "常闇の竜レグナード",
        "jobs": ["僧侶", "魔法戦士", "魔法使い", "パラディン"]
    },
    "darkking": {
        "name": "ダークキング",
        "jobs": ["僧侶", "デスマスター", "どうぐ使い", "まもの使い", "バトルマスター"]
    },
    "maeve": {
        "name": "海冥主メイヴ",
        "jobs": ["僧侶", "どうぐ使い", "まもの使い", "武闘家", "戦士"]
    }
}
