guardian_info = {
    "purple": {
        "name": "冥骸魔レギルラッゾ＆獣魔ローガスト",
        "jobs": ["僧侶", "天地雷鳴士", "占い師"]
    },
    "red": {
        "name": "紅殻魔スコルパイド",
        "jobs": ["賢者", "どうぐ使い", "まもの使い"],
    },
    "green": {
        "name": "翠将鬼ジェルザーク",
        "jobs": ["僧侶", "魔法使い", "魔法戦士"],
    },
    "yellow": {
        "name": "剛獣鬼ガルドドン",
        "jobs": ["デスマスター", "賢者", "魔法使い", "魔法戦士"],
    },
    "blue": {
        "name": "邪蒼鎧デルメゼ",
        "jobs": ["僧侶", "どうぐ使い", "レンジャー", "武闘家", "まもの使い"],
    },
    "black": {
        "name": "羅刹王バラシュナ",
        "jobs": ["僧侶", "どうぐ使い", "魔法使い", "賢者"]
    }
}
